#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.webserver-ec2.aws_instance.web-server will be created
  + resource "aws_instance" "web-server" {
      + ami                          = "ami-088911543b10876a4"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Marcos Soares"
          + "Project"   = "Clicksign"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "bef42c7d19bd5d1c757241dd38759389a2a1b33f"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.webserver-ec2.aws_internet_gateway.web-server will be created
  + resource "aws_internet_gateway" "web-server" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.webserver-ec2.aws_security_group.container-docker will be created
  + resource "aws_security_group" "container-docker" {
      + arn                    = (known after apply)
      + description            = "Permitir trafego Publico de Entrada na Porta 80"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "Web"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.webserver-ec2.aws_security_group.https will be created
  + resource "aws_security_group" "https" {
      + arn                    = (known after apply)
      + description            = "Permitir trafego de Saida para a internet"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "https"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.webserver-ec2.aws_subnet.web-server["pub_a"] will be created
  + resource "aws_subnet" "web-server" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "Public A"
          + "Owner"     = "Marcos Soares"
          + "Project"   = "Clicksign"
        }
      + vpc_id                          = (known after apply)
    }

  # module.webserver-ec2.aws_subnet.web-server["pub_b"] will be created
  + resource "aws_subnet" "web-server" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "Public B"
          + "Owner"     = "Marcos Soares"
          + "Project"   = "Clicksign"
        }
      + vpc_id                          = (known after apply)
    }

  # module.webserver-ec2.aws_subnet.web-server["pvt_a"] will be created
  + resource "aws_subnet" "web-server" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "Private A"
          + "Owner"     = "Marcos Soares"
          + "Project"   = "Clicksign"
        }
      + vpc_id                          = (known after apply)
    }

  # module.webserver-ec2.aws_subnet.web-server["pvt_b"] will be created
  + resource "aws_subnet" "web-server" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "sa-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "Private B"
          + "Owner"     = "Marcos Soares"
          + "Project"   = "Clicksign"
        }
      + vpc_id                          = (known after apply)
    }

  # module.webserver-ec2.aws_vpc.web-server will be created
  + resource "aws_vpc" "web-server" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + igw_id     = (known after apply)
  + public_dns = (known after apply)
  + public_ip  = (known after apply)
  + subnet_ids = {
      + Private A = (known after apply)
      + Private B = (known after apply)
      + Public A  = (known after apply)
      + Public B  = (known after apply)
    }
  + vpc_id     = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @msoaresdevops, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*